{
  "global_disclaimer": "This PCB design is generated by an automated tool and has NOT been reviewed by a professional electrical engineer. It is the user's responsibility to verify the design meets all applicable safety standards, regulations, and certification requirements before manufacturing or deployment. This tool is NOT suitable for safety-critical, life-support, automotive safety, or medical device applications.",
  "conditional_warnings": {
    "mains_power": [
      "⚡ WARNING: This design includes MAINS VOLTAGE (100-240VAC) circuits",
      "Risk of electric shock, fire, and death if improperly constructed",
      "Mains wiring and installation must be performed by a qualified electrician",
      "Final product MUST be enclosed — no exposed mains connections",
      "Minimum 8mm creepage/clearance between mains and low-voltage circuits",
      "This design has NOT been tested for IEC 62368-1 or IEC 60950-1 compliance",
      "CE/UL/TUV certification required before commercial sale"
    ],
    "lipo_battery": [
      "🔋 WARNING: This design uses lithium polymer batteries",
      "LiPo batteries are a fire and explosion risk if mishandled",
      "Do not charge below 0°C or above 45°C",
      "Do not discharge below 2.5V per cell",
      "Use batteries with built-in protection PCBs when possible",
      "Store at 3.7-3.8V for long-term storage",
      "Charge only in a fireproof location with supervision",
      "Dispose of damaged/swollen batteries safely — do not puncture or incinerate"
    ],
    "relay_mains_switching": [
      "⚡ WARNING: This design switches MAINS VOLTAGE through relay contacts",
      "Relay must be rated for mains voltage (minimum 250VAC contact rating)",
      "Mains-side traces require minimum 2mm width and 8mm creepage to logic",
      "Board must include mains fuse and be fully enclosed",
      "Arc suppression snubber on relay contacts is included but does not eliminate all risk",
      "Not suitable for switching inductive mains loads without additional protection"
    ],
    "motor_high_current": [
      "🔧 WARNING: This design includes motor drivers carrying high current",
      "Motor traces must be sized for maximum stall current, not running current",
      "Motor stall current can be 5-10x running current",
      "Ensure adequate ventilation for motor driver thermal dissipation",
      "External motor power supply recommended for loads exceeding 1A"
    ],
    "rf_regulatory": [
      "📡 NOTE: This design includes RF transmitter circuitry",
      "Operation may require regulatory certification (FCC Part 15, CE RED, etc.)",
      "Using pre-certified RF modules (ESP32-WROOM, SIM7080G) simplifies certification",
      "Bare RF ICs (nRF52840) require separate modular or intentional radiator certification",
      "Antenna design affects both performance and regulatory compliance"
    ],
    "outdoor_environmental": [
      "🌧 NOTE: Components selected for outdoor/environmental applications",
      "PCB should be conformal coated (e.g. Electrolube HPA) for moisture protection",
      "All connectors should be IP-rated if exposed to weather",
      "Verify all components meet operating temperature range for deployment environment",
      "UV exposure degrades PCB solder mask — use UV-resistant enclosure"
    ]
  },
  "resolver_rules": {
    "ldo_thermal_budget": "If (VIN - VOUT) × I_load > 1W, insert switching pre-regulator or replace LDO with buck converter. AMS1117 thermal pad dissipates ~1.5W max on 2-layer PCB.",
    "trace_width_minimum": "Power traces: 1mm per amp minimum (external layers), 0.5mm per amp (internal). Use IPC-2221 calculator for exact values based on copper weight and temperature rise.",
    "mains_creepage": "Minimum 8mm creepage, 4mm clearance between mains and SELV circuits. Use board slots (min 1mm wide) to increase effective creepage distance.",
    "cap_voltage_derating": "Ceramic capacitor voltage rating must be minimum 2x operating voltage (DC bias derating). 6.3V cap on 5V rail = marginal. Use 10V minimum on 5V rail, 16V on 12V rail.",
    "usb_vbus_capacitance": "Maximum 10µF directly on USB VBUS line. Larger bulk caps go after regulator/charger input."
  }
}
